##### Make sure xcode is installed first
##### xcode-select --install
tap "homebrew/cask-versions"
tap "aws/tap"

cask "1password"                         # Password manager that keeps all passwords secure behind one password
cask "1password-cli"                     # Command-line interface for 1Password
brew "act"                               # Run your GitHub Actions locally
cask "alfred"                            # Application launcher and productivity software
brew "ansible"                           # Automate deployment, configuration, and upgrading
cask "atom"                              # Github Atom - Text editor
brew "autoconf"                          # Automatic configure script builder
brew "autojump"                          # Shell extension to jump to frequently used directories
brew "aws-sam-cli"                       # CLI tool to build, test, debug, and deploy Serverless applications using AWS SAM
brew "awscli"                            # Official Amazon AWS command-line interface
brew "azure-cli"                         # Microsoft Azure CLI 2.0
cask "azure-data-studio"                 # Data management tool that enables working with SQL Server
brew "bash"                              # Bourne-Again SHell, a UNIX command interpreter
brew "bash-completion@2"                 # Programmable completion for Bash 4.2+
brew "bats-core"                         # Bash Automated Testing System
brew "buf"                               # New way of working with Protocol Buffers
brew "cairo"                             # Vector graphics library with cross-device output support
brew "cfssl"                             # CloudFlare's PKI toolkit
cask "chef/chef/inspec"                  # InSpec by Chef
brew "cmake"                             # Cross-platform make
brew "coreutils"                         # GNU File, Shell, and Text utilities
brew "csshx"                             # Cluster ssh tool for Terminal.app
cask "diffmerge"                         # Visually compare and merge files
cask "discord"                           # Voice and text chat software
brew "docker"                            # Pack, ship and run any application as a lightweight container
cask "docker"                            # Pack, ship and run any application as a lightweight container
brew "docutils"                          # Text processing system for reStructuredText
cask "dropbox"                           # Client for the Dropbox cloud storage service
brew "espeak"                            # Text to speech, software speech synthesizer
cask "firefox"                           # Firefox Web browser
brew "fzf"                               # Command-line fuzzy finder written in Go
brew "gh"                                # GitHub command-line tool
brew "git"                               # Distributed revision control system
brew "glib"                              # Core application library for C
brew "gnu-getopt"                        # Command-line option parsing utility
brew "gnupg"                             # GNU Pretty Good Privacy (PGP) package
brew "gnutls"                            # GNU Transport Layer Security (TLS) Library
brew "go"                                # Open source programming language to build simple/reliable/efficient software
brew "gobject-introspection"             # Generate introspection data for GObject libraries
cask "google-cloud-sdk"                  # Set of tools to manage resources and applications hosted on Google Cloud
brew "graphviz"                          # Graph visualization software from AT&T and Bell Labs
brew "guile"                             # GNU Ubiquitous Intelligent Language for Extensions
brew "hadolint"                          # Smarter Dockerfile linter to validate best practices
brew "harfbuzz"                          # OpenType text shaping engine
brew "hatch"                             # Modern, extensible Python project management
brew "helm"                              # Kubernetes package manager
brew "helmfile"                          # Deploy Kubernetes Helm Charts
cask "intellij-idea"                     # Java IDE by JetBrains
cask "iterm2"                            # Terminal emulator as alternative to Apple's Terminal app
brew "ipcalc"                            # Calculate various network masks, etc. from a given IP address
brew "istioctl"                          # Istio configuration command-line utility
brew "jenv"                              # Manage your Java environment
brew "ankitpokhrel/jira-cli/jira-cli"    # Feature-rich interactive Jira command-line
brew "jq"                                # Lightweight and flexible command-line JSON processor
brew "jsonnet"                           # Domain specific configuration language for defining JSON data
brew "k9s"                               # Kubernetes CLI To Manage Your Clusters In Style!
cask "keybase"                           # End-to-end encryption software
brew "kind"                              # Run local Kubernetes cluster in Docker
brew "krew"                              # Package manager for kubectl plugins
brew "robscott/tap/kube-capacity"        # kube-capacity provides an overview of the resource requests, limits, and utilization in a Kubernetes cluster
brew "kube-ps1"                          # Kubernetes prompt info for bash and zsh
brew "kubebuilder"                       # SDK for building Kubernetes APIs using CRDs
brew "kubeconform"                       # FAST Kubernetes manifests validator, with support for Custom Resources!
brew "kubectx"                           # Tool that can switch between kubectl contexts easily and create aliases
brew "Azure/kubelogin/kubelogin"         # OpenID Connect authentication plugin for kubectl
brew "kubernetes-cli"                    # Kubernetes command-line interface
brew "johanhaleby/kubetail/kubetail"     # Tail logs from multiple Kubernetes pods at the same time
brew "kustomize"                         # Template-free customization of Kubernetes YAML manifests
cask "lens"                              # Kubernetes IDE
brew "liquibase"                         # Library for database change tracking
brew "little-cms2"                       # Color management engine supporting ICC profiles
brew "lua"                               # Powerful, lightweight programming language
brew "maven"                             # Java-based project management
cask "microsoft-azure-storage-explorer"  # Explorer for Azure Storage
cask "mongodb-compass"                   # Interactive tool for analyzing MongoDB data
cask "mono-mdk-for-visual-studio"        # Open source implementation of Microsoft's .NET Framework
brew "nmap"                              # Port scanning utility for large networks
brew "node-build"                        # Install NodeJS versions
brew "nodenv"                            # Manage multiple NodeJS versions
brew "p11-kit"                           # Library to load and enumerate PKCS#11 modules
brew "pango"                             # Framework for layout and rendering of i18n text
cask "pgadmin4"                          # Administration and development platform for PostgreSQL
brew "pipenv"                            # Python dependency management tool
brew "popeye"                            # Kubernetes cluster resource sanitizer
brew "postgresql@14"                     # Object-relational database system
cask "postman"                           # Collaboration platform for API development
brew "powershell/tap/powershell"         # Formula to install PowerShell
brew "pre-commit"                        # Framework for managing multi-language pre-commit hooks
brew "protobuf"                          # Protocol buffers (Google's data interchange format)
brew "pyenv"                             # Python version management
brew "rbenv"                             # Ruby version manager
brew "redis"                             # Persistent key-value database, with built-in net interface
brew "ruby-build"                        # Install various Ruby versions and implementations
brew "rustup"                            # Rust toolchain installer
brew "screen"                            # Terminal multiplexer with VT100/ANSI terminal emulation
cask "session-manager-plugin"            # Plugin for AWS CLI to start and end sessions that connect to managed instances
brew "shellcheck"                        # Static analysis and lint tool, for (ba)sh scripts
# cask "slack"                             # Team communication and collaboration software
brew "sops"                              # Editor of encrypted files
cask "spotify"                           # Music streaming service
brew "stern"                             # Tail multiple Kubernetes pods & their containers
brew "tcl-tk"                            # Tool Command Language
brew "tcpdump"                           # Command-line packet analyzer
brew "telnet"                            # User interface to the TELNET protocol
# cask "temurin"                           # JDK from the Eclipse Foundation (Adoptium)
brew "terraform-docs"                    # Tool to generate documentation from Terraform modules
brew "terraformer"                       # CLI tool to generate terraform files from existing infrastructure
brew "warrensbox/tap/tfswitch"           # The tfswitch command lets you switch between terraform versions.
brew "tmux"                              # Terminal multiplexer
brew "tree"                              # Display directories as trees (with optional color/HTML output)
brew "trivy"                             # Vulnerability scanner for container images, file systems, and Git repos
brew "tsqllint/tsqllint/tsqllint"        # Configurable linting for TSQL
brew "unbound"                           # Validating, recursive, caching DNS resolver
brew "loft-sh/tap/vcluster-experimental" # Creates fully functional virtual k8s cluster inside host k8s cluster's namespace
cask "virtualbox@beta"                   # Virtualiser for x86 hardware
brew "virtualenv"                        # Tool for creating isolated virtual python environments
cask "visual-studio"                     # Integrated development environment
cask "visual-studio-code"                # Open-source code editor
brew "watch"                             # Executes a program periodically, showing output fullscreen
brew "webp"                              # Image format providing lossless and lossy compression for web images
cask "whatsapp"                          # Native desktop client for WhatsApp
brew "wireshark"                         # Network analyzer and capture tool - without graphical user interface
cask "wireshark"                         # Network analyzer and capture tool
brew "xz"                                # General-purpose data compression with high compression ratio
brew "yq"                                # Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "zstd"                              # Zstandard is a real-time compression algorithm
