tap "ankitpokhrel/jira-cli"
tap "aws/tap"
tap "azure/kubelogin"
tap "chef/chef"
tap "homebrew/bundle"
tap "johanhaleby/kubetail"
tap "loft-sh/tap"
tap "powershell/tap"
tap "robscott/tap"
tap "tsqllint/tsqllint"
tap "warrensbox/tap"
brew "act"
brew "ansible"
brew "zstd"
brew "little-cms2"
brew "webp"
brew "autoconf"
brew "autojump"
brew "aws-sam-cli"
brew "awscli"
brew "azure-cli"
brew "bash"
brew "bash-completion@2"
brew "coreutils"
brew "bats-core"
brew "buf"
brew "glib"
brew "cairo"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "cask"
brew "cfssl"
brew "cmake"
brew "csshx"
brew "docutils"
brew "dotnet", link: false
brew "espeak"
brew "fzf"
brew "gh"
brew "git"
brew "gnu-getopt"
brew "gnupg"
brew "go"
brew "gobject-introspection"
brew "harfbuzz"
brew "pango"
brew "graphviz"
brew "guile"
brew "hadolint"
brew "hatch"
brew "helm"
brew "helmfile"
brew "ipcalc"
brew "istioctl"
brew "jenv"
brew "jq"
brew "jsonnet"
brew "k9s"
brew "kind"
brew "kubernetes-cli"
brew "krew"
brew "kube-ps1"
brew "kubebuilder"
brew "kubeconform"
brew "kubectx"
brew "kustomize"
brew "liquibase"
brew "lua"
brew "maven"
brew "nmap"
brew "node-build"
brew "nodenv"
brew "pipenv"
brew "popeye"
# brew "postgresql@14"
brew "pre-commit"
brew "protobuf"
brew "pyenv"
brew "ruby-build"
brew "rbenv"
brew "redis"
brew "rustup"
brew "screen"
brew "shellcheck"
brew "sops"
brew "stern"
brew "tcl-tk"
brew "tcpdump"
brew "telnet"
brew "terraform-docs"
brew "terraformer"
brew "tmux"
brew "tree"
brew "trivy"
brew "velero"
brew "virtualenv"
brew "watch"
brew "wireshark"
brew "yq"
brew "ankitpokhrel/jira-cli/jira-cli"
brew "azure/kubelogin/kubelogin"
brew "johanhaleby/kubetail/kubetail"
brew "loft-sh/tap/vcluster-experimental"
brew "powershell/tap/powershell"
brew "robscott/tap/kube-capacity"
brew "tsqllint/tsqllint/tsqllint"
brew "warrensbox/tap/tfswitch"
cask "1password"
cask "1password-cli"
cask "alfred"
# cask "ankerwork"
cask "azure-data-studio"
cask "cursor"
cask "diffmerge"
cask "discord"
cask "divvy"
cask "docker"
cask "dotnet-sdk"
cask "dropbox"
cask "firefox"
cask "google-cloud-sdk"
cask "inspec"
cask "iterm2"
cask "keybase"
cask "lens"
cask "microsoft-azure-storage-explorer"
cask "mongodb-compass"
cask "postman"
# cask "slack"
cask "session-manager-plugin"
cask "spotify"
cask "virtualbox"
# cask "visual-studio"
cask "visual-studio-code"
cask "whatsapp"
vscode "hashicorp.terraform"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.powershell"
vscode "redhat.vscode-yaml"
