## Make sure xcode is installed first
## xcode-select --install
tap "homebrew/cask-versions"
tap "homebrew/cask"

## aws
tap "aws/tap"
brew "awscli"
brew "aws-sam-cli"
## bash / shell
brew "autojump"
brew "bash"
brew "bash-completion@2"
brew "dep"
brew "fzf"
brew "espeak"
brew "jq"
brew "readline"
brew "tree"
brew "watch"
brew "yq"
brew "bats-core"
## build tools
brew "autoconf"
brew "cmake"
brew "coreutils"
brew "git"
brew "maven"
## checks
brew "shellcheck"
## configuration management
brew "ansible"
## data
brew "redis"
cask "pgadmin4"
## docker
brew "docker"
brew "hadolint"
## encryption / tls
brew "cfssl"
brew "gnupg"
brew "openssl"
brew "sops"
brew "sslyze"
## helm
brew "helmfile"
brew "gnu-getopt"
## jira-cli
tap "ankitpokhrel/jira-cli"
brew "jira-cli"
## kubernetes
tap "derailed/k9s"
brew "k9s"
brew "kind"
brew "kube-ps1"
brew "kubectx"
brew "kubernetes-cli"
brew "helm"
tap "johanhaleby/kubetail"
brew "kubetail"
brew "kustomize"
brew "istioctl"
tap "derailed/popeye"
brew "popeye"
brew "stern"
brew "krew"
brew "kubebuilder"
brew "kubeconform"
## languages / dev environments
brew "gh"
brew "go"
brew "jenv"
brew "jsonnet"
brew "lua"
brew "node-build"
brew "nodenv"
brew "pipenv"
brew "pyenv"
brew "rbenv"
brew "rustup-init"
## multiplexer
brew "screen"
brew "tmux"
## networking
brew "ipcalc"
brew "nmap"
brew "tcpdump"
brew "wireshark"
## other
brew "graphviz"
#brew "qt" # QT cross-platform framework and tools
## ssh
tap "parera10/csshx"
brew "csshx"
## terraform
tap "warrensbox/tap" # tfswitch
#brew "terraform" # tfswitch ftw!
brew "terraform-docs"
brew "tfswitch"
# security
tap "aquasecurity/trivy"
brew "trivy"

## CASKS
## These are grouped together as they may prompt for password.

## 1password
cask "1password-cli"
cask "1password"
## aws
cask "session-manager-plugin"
## browsers
cask "firefox"
# cask "google-chrome" ## ALREADY INSTALLED; UNCOMMENT OTHERWISE
## communications
cask "whatsapp"
# cask "slack" ## ALREADY INSTALLED; UNCOMMENT OTHERWISE
## data
cask "mongodb-compass"
## docker / k8s
cask "docker"
cask "kitematic"
cask "lens"
## editors
cask "atom"
cask "visual-studio-code"
cask "intellij-idea"
## encryption / tls
cask "keybase"
## google cloud sdk
cask "google-cloud-sdk"
## inspec
tap "chef/chef"
cask "inspec"
## java
tap "adoptopenjdk/openjdk"
#cask "adoptopenjdk8"
#cask "adoptopenjdk9"
#cask "adoptopenjdk10"
cask "adoptopenjdk11"
#cask "adoptopenjdk12"
#cask "adoptopenjdk13"
#cask "adoptopenjdk14"
#cask "adoptopenjdk15"
cask "adoptopenjdk16"
## music
cask "spotify"
## networking
cask "wireshark"
## other
cask "alfred"
cask "diffmerge"
cask "dropbox"
cask "postman"
## terminal
cask "iterm2"
## vpn
cask "pritunl"
